Repository: lskbr/nim_for_python_programmers
Catalog: locale/*/LC_MESSAGES/Nim-for-Python-Programmers.po
Languages: pt_br

source: Table Of Contents
pt_br: Índice

source: [Comparison](#Comparison)
pt_br: [Comparação](#Comparison)

source: [Objects](#Objects)
pt_br: [Objetos](#Objects)

source: [Do I have to know C?](#do-i-have-to-know-c)
pt_br: [Eu tenho que conhecer C?](#do -eu tenho que saber-c)

source: [Named Tuples](#named-tuple-1)
pt_br: [Tuplas nomeadas](#named -tuple-1)

source: [Variables](#Variables)
pt_br: [Variáveis](#Variables)

source: [Lists](#Lists)
pt_br: [Listas](#Lists)

source: [Variable Naming](#variable-naming)
pt_br: [Nomeando de variáveis](#variable -naming)

source: [Consistent Spacing](#consistent-spacing)
pt_br: [Espaçamento consistente](#consistent -spacing)

source: [Scoping](#scoping)
pt_br: [Escopo](#scoping)

source: [Mutable arguments](#mutable-arguments)
pt_br: [Argumentos mutáveis](#mutable -arguments)

source: [Ranges](#Ranges)
pt_br: [Intervalos](#Ranges)

source: [String Operations](#string-ops)
pt_br: [Operações com cadeias de caracteres](#string -ops)

source: [Static Bounds Checks](#static-bounds-check)
pt_br: [Verificações estática de limites](#static -bounds-check)

source: [Null Coalescing](#null-coalescing)
pt_br: [Coalescência nula](#null -coalescência)

source: [`with` Context Manager](#with-context-manager)
pt_br: [`with` Gerenciador de Contextos](#with -context-manager)

source: [Arrays](#Arrays)
pt_br: [Matrizes](#Arrays)

source: [Slices](#Slices)
pt_br: [Fatias](#Slices)

source: [Tuples](#Tuples)
pt_br: [Tuplas](#Tuples)

source: [Dict Comprehensions](#Dict-Comprehensions)
pt_br: [Dict Compreensions](#Dict -Compreensões)

source: [Set Comprehensions](#Set-Comprehensions)
pt_br: [Set Comprehensions](#Set -Compreensões)

source: [Reading and writing files](#Reading-and-writing-files)
pt_br: [Lendo e gravando arquivos](#Reading -and-writing-files)

source: [Decorators](#Decorators)
pt_br: [Decoradores](#Decorators)

source: [Sets](#Sets)
pt_br: [Conjuntos](#Sets)

source: [Map & Filter](#map--filter)
pt_br: [Map e filter](#map —filter)

source: [Optional Indentation](#Optional-Indentation)
pt_br: [Indentação opcional](#Optional -Indentação)

source: [Dictionaries](#Dictionaries)
pt_br: [Dicionários](#Dictionaries)

source: [Import Nim files in Python](#Import-Nim-files-on-Python)
pt_br: [Importar arquivos Nim em Python](#Import -Nim-files-on-Python)

source: [Ternary operators](#Ternary-operators)
pt_br: [Operadores ternários](#Ternary -operadores)

source: [Unittests](#Unittests)
pt_br: [Testes unitários](#Unittests)

source: [def Vs proc / func](#def-vs-procfunc)
pt_br: [def x proc/func](#def -vs-procfunc)

source: [Self-Execution of Main Module](#Self-Execution-of-Main-Module)
pt_br: [Autoexecução do módulo principal](#Self -Execução do módulo principal)

source: [Python Syntax for Nim](#Python-Syntax-for-Nim)
pt_br: [Sintaxe Python para Nim](#Python -Syntax-for-NIM)

source: [Publish to PYPI](#Publish-to-PYPI)
pt_br: [Publicar no PYPI](#Publish para PYPI)

source: [Silent Compilation](#Silent-Compilation)
pt_br: [Compilação silenciosa](#Silent -Compilação)

source: [Compiler Help](#Compiler-Help)
pt_br: [Ajuda do compilador](#Compiler -Help)

source: [Build Modes](#Build-Modes)
pt_br: [Modos de construção](#Build -Modes)

source: [Abstract Base Classes](#ABC)
pt_br: [ABC - Classes básicas abstratas](#ABC)

source: [Templates](#Templates)
pt_br: [Modelos](#Templates)

source: [Nim running Interpreted](https://nim-lang.org/docs/nims.html)
pt_br: [Nim executando interpretado](https://nim-lang.org/docs/nims.html)

source: [Nim on the browser](https://github.com/nim-lang/Nim/wiki/Nim-for-TypeScript-Programmers#table-of-contents)
pt_br: [Nim no navegador](https://github.com/nim-lang/Nim/wiki/Nim-for-TypeScript-Programmers#table-of-contents)

source: [Standard Library Equivalents](#Standard-Library-Equivalents)
pt_br: [Equivalentes da biblioteca padrão](#Standard-Library-Equivalents)

source: [Async](#Async)
pt_br: [Assíncrono](#Async)

source: [Install Nim from PIP](https://github.com/juancarlospaco/choosenim_install#use)
pt_br: [Instale o Nim do PIP](https://github.com/juancarlospaco/choosenim_install#use)

source: [Cheatsheet PDF](https://www.overleaf.com/read/svnxffsjvscy)
pt_br: [Folha de dicas em PDF](https://github.com/lskbr/nim_cheat_seat_pt_br/releases)

source: [Arrow Functions](https://github.com/nim-lang/Nim/wiki/Nim-for-TypeScript-Programmers#Arrow-Functions)
pt_br: [Funções Arrow](https://github.com/nim-lang/Nim/wiki/Nim-for-TypeScript-Programmers#Arrow-Functions)

source: [How to share variables between functions?](#How-to-share-variables-between-functions)
pt_br: [Como compartilhar variáveis entre funções?](#How-to-share-variables-between-functions)

source: [Change File Permissions](#Change-File-Permissions)
pt_br: [Alterar permissões do arquivo](#Change -File-Permissions)

source: [Temporarily Change Folder](#Temporarily-Change-Folder)
pt_br: [Alterar pasta temporariamente](#Temporarily -Change-Folder)

source: [Pattern Matching](https://github.com/nim-lang/fusion/blob/master/src/fusion/matching.rst)
pt_br: [Pattern Matching - Correspondência de padrões](https://github.com/nim-lang/fusion/blob/master/src/fusion/matching.rst)

source: [Best Practices](https://github.com/nim-lang/Nim/wiki/best-practices#best-practices)
pt_br: [Melhores práticas](https://github.com/nim-lang/Nim/wiki/best-practices#best-practices)

source: [In-Place Vs Out-Place](#in-Place-vs-out-place)
pt_br: [No local versus fora do lugar](#in -Place-vs-Out-Place)

source: [Run in NodeJS](https://github.com/nim-lang/Nim/wiki/Nim-for-TypeScript-Programmers#nodejs-compatibility)
pt_br: [Executar no NodeJS](https://github.com/nim-lang/Nim/wiki/Nim-for-TypeScript-Programmers#nodejs-compatibility)

source: [Code Expansion](#run-time-code-expansion)
pt_br: [Expansão de código](#run -time-code-expansion)

source: [Arduino, MicroPython, ESP32, FreeRTOS](#MicroPython)
pt_br: [Arduino, MicroPython, ESP32, RTOS grátis](#MicroPython)

source: [LiveCoding, FoxDot, SuperCollider](#SuperCollider)
pt_br: [Codificação ao vivo, FoxDot, SuperCollider](#SuperCollider)

source: [PIP-installable Nim embedded inside Python](https://github.com/juancarlospaco/nim4py#nim4python)
pt_br: [Nim instalável por PIP incorporado em Python](https://github.com/juancarlospaco/nim4py#nim4python)

source: [Install Nim packages from PIP](https://github.com/juancarlospaco/nimble_install#use)
pt_br: [Instale pacotes Nim do PIP](https://github.com/juancarlospaco/nimble_install#use)

source: [English Version](https://github.com/nim-lang/Nim/wiki/Nim-for-Python-Programmers#table-of-contents)
pt_br: [Versão em inglês](https://github.com/nim-lang/Nim/wiki/Nim-for-Python-Programmers#table-of-contents)

source: [Spanish Version](https://github.com/nim-lang/Nim/wiki/Nim-for-Python-Programmers-ES#tabla-de-contenidos)
pt_br: [Versão em espanhol](https://github.com/nim-lang/Nim/wiki/Nim-for-Python-Programmers-ES#tabla-de-contenidos)

source: Comparison
pt_br: Comparação

source: Feature
pt_br: Característica

source: Execution model
pt_br: Modelo de execução

source: Virtual Machine (Interpreter)
pt_br: Máquina virtual (interpretador)

source: Machine code via C/C++ (Compiler)
pt_br: Código de máquina via C/C++ (compilador)

source: Written using
pt_br: Escrito usando

source: License
pt_br: Licença

source: Python Software Foundation License
pt_br: Licença da Python Software Foundation

source: Version (Major)
pt_br: Versão (principal)

source: Metaprogramming
pt_br: Metaprogramação

source: :heavy_check_mark: metaclass, exec, eval, [ast](https://docs.python.org/3/library/ast.html) (Run-time code expansion)
pt_br: :heavy_check_mark: metaclass, exec, eval, [ast](https://docs.python.org/3/library/ast.html) (expansão de código em tempo de execução)

source: :heavy_check_mark: [template, macros](https://nim-lang.github.io/Nim/manual.html#macros) (Compile-time code expansion)
pt_br: :heavy_check_mark: [modelo, macros](https://nim-lang.github.io/Nim/manual.html#macros) (expansão do código em tempo de compilação)

source: Memory management
pt_br: Gerenciamento de memória

source: Garbage collector
pt_br: Coletor de lixo

source: [Multi-paradigm memory management](https://nim-lang.github.io/Nim/gc.html) (garbage collectors, [ARC/ORC](https://www.youtube.com/watch?v=aUJcYTnPWCg), manual)
pt_br: [Gerenciamento de memória multiparadigma](https://nim-lang.github.io/Nim/gc.html) (coletores de lixo, [ARC/ORC](https://www.youtube.com/watch?v=aUJcYTnPWCg), manual)

source: Typing
pt_br: Tipagem

source: Dynamic, Duck Typing
pt_br: Dinâmica, Duck Typing

source: Static
pt_br: Estática

source: Dependent types
pt_br: Tipos dependentes

source: :heavy_check_mark: Partial support
pt_br: :heavy_check_mark: Suporte parcial

source: Generics
pt_br: Genéricos

source: int8/16/32/64 types
pt_br: tipos int8/16/32/64

source: uint8/16/32/64 types
pt_br: tipos uint8/16/32/64

source: float32/float64 types
pt_br: tipos float32/float64

source: Char types
pt_br: Tipos de caractere

source: Subrange types
pt_br: Tipos de subfaixa

source: Enum types
pt_br: Tipos de enum

source: Bigints (arbitrary size)
pt_br: Bigints (tamanho arbitrário)

source: Biggest built-in integer
pt_br: Maior número inteiro embutido

source: Unknown, limited by free memory
pt_br: Desconhecido, limitado pela memória livre

source: `18_446_744_073_709_551_615` for `uint64` type
pt_br: `18_446_744_073_709_551_615` para o tipo `uint64`

source: Arrays
pt_br: Matrizes

source: Type inference
pt_br: Inferência de tipo

source: Operator overloading
pt_br: Sobrecarga do operador

source: :heavy_check_mark: on any type
pt_br: :heavy_check_mark: em qualquer tipo

source: Custom operators
pt_br: Operadores personalizados

source: Object-Oriented
pt_br: Orientado a objetos

source: Methods
pt_br: Métodos

source: Exceptions
pt_br: Exceções

source: Anonymous functions
pt_br: Funções anônimas

source: :heavy_check_mark: multi-line, single-expression
pt_br: :heavy_check_mark: várias linhas, expressão única

source: :heavy_check_mark: multi-line, multi-expression
pt_br: :heavy_check_mark: várias linhas, várias expressões

source: Custom object comprehensions
pt_br: Compreensões personalizadas de objetos

source: :heavy_check_mark: generator expression
pt_br: :heavy_check_mark: expressão geradora

source: Pattern Matching builtin
pt_br: Pattern Matching embutido

source: :heavy_check_mark: As of Python 3.10
pt_br: :heavy_check_mark: A partir do Python 3.10

source: Immutability of types
pt_br: Imutabilidade dos tipos

source: Basic types (number, string, bool), tuple, frozenset
pt_br: Tipos básicos (número, string, bool), tuple, frozenset

source: Immutability of variables
pt_br: Imutabilidade das variáveis

source: Function arguments immutability
pt_br: Imutabilidade dos argumentos da função

source: Depending on type
pt_br: Dependendo do tipo

source: Immutable
pt_br: Imutável

source: Formatted string literals
pt_br: Literais de string formatados

source: :heavy_check_mark: ctypes, C extension API (Cython via pip)
pt_br: :heavy_check_mark: ctypes, API de extensão C (Cython via pip)

source: :heavy_check_mark: C, C++, Objective C, JS (depending on used backend)
pt_br: :heavy_check_mark: C, C++, Objective C, JS (dependendo do backend usado)

source: Async
pt_br: Assíncrono

source: Threads
pt_br: Tópicos

source: :heavy_check_mark: Global Interpreter Lock
pt_br: :heavy_check_mark: GIL - Bloqueio de intérprete global

source: :heavy_check_mark: Perl-compatible
pt_br: :heavy_check_mark: compatível com Perl

source: Documentation comments
pt_br: Comentários da documentação

source: :heavy_check_mark: plain-text multi-line strings (reStructuredText via Sphinx)
pt_br: :heavy_check_mark: cadeias de texto simples com várias linhas (reStructuredText via Sphinx)

source: Package publishing
pt_br: Publicação de pacotes

source: :heavy_check_mark: not built-in, requires `twine`
pt_br: :heavy_check_mark: não embutido, requer `twine`

source: :heavy_check_mark: built-in, `nimble`
pt_br: :heavy_check_mark: embutido, `nimble`

source: Package manager
pt_br: Gerenciador de pacotes

source: Code autoformatter
pt_br: Formatador automático de código

source: :heavy_check_mark: `black` and others via pip
pt_br: :heavy_check_mark: `black` e outros via pip

source: :heavy_check_mark: `nimpretty` built-in, [nimlint](https://github.com/nim-dev/nimlint)
pt_br: :heavy_check_mark: `nimpretty` embutido, [nimlint](https://github.com/nim-dev/nimlint)

source: File extensions
pt_br: Extensões de arquivo

source: Temporary intermediate representation (IR) format
pt_br: Formato de representação intermediária temporária (IR)

source: .pyc (CPython VM bytecode)
pt_br: .pyc (código de bytes da VM do CPython)

source: Uses #!shebang on files
pt_br: Usa #! shebang em arquivos

source: Indentation
pt_br: Indentação

source: Tabs and spaces, uniform per code block, 4 spaces by convention
pt_br: Tabulações e espaços, uniformes por bloco de código, 4 espaços por convenção

source: Spaces only, uniform per code block, 2 spaces by convention
pt_br: Somente espaços, uniforme por bloco de código, 2 espaços por convenção

source: Notes:
pt_br: Notas:

source: Python anonymous function (lambdas) are known to be slow compared to normal functions.
pt_br: Sabe-se que as funções anônimas do Python (lambdas) são lentas em comparação com as funções normais.

source: Python Regex claims to be PCRE compatible, but in practice PCRE Regexes may not work.
pt_br: O Python Regex afirma ser compatível com PCRE, mas na prática os PCRE Regexes podem não funcionar.

source: Python "multi-line" anonymous functions may require using `;` and Linters/IDE may complain about it.
pt_br: As funções anônimas “de várias linhas” do Python podem exigir o uso de `;` e o Linters/IDE pode reclamar disso.

source: Variables
pt_br: Variáveis

source: Creating a new variable uses `var` or `let` or `const`. Nim has immutability and compile-time function execution. You can assign functions to variables.
pt_br: A criação de uma nova variável usa `var` ou `let` ou `const`. Nim tem imutabilidade e execução de funções em tempo de compilação. Você pode atribuir funções às variáveis.

source: Run-Time
pt_br: Tempo de execução

source: NO
pt_br: NÃO

source: :heavy_check_mark: YES
pt_br: :heavy_check_mark: SIM

source: Compile-Time
pt_br: Tempo de compilação

source: Reassignable
pt_br: Reatribuível

source: Requires Assignment
pt_br: Requer atribuição

source: Can be Global
pt_br: Pode ser global

source: [For advanced users, it is possible to skip variable Auto-Initialization.](https://nim-lang.github.io/Nim/manual.html#statements-and-expressions-var-statement)
pt_br: [Para usuários avançados, é possível ignorar a inicialização automática de variáveis.](https://nim-lang.github.io/Nim/manual.html#statements-and-expressions-var-statement)

source: Variable Naming
pt_br: Nomeação de variáveis

source: Variables can be multi-line without "escaping" them or using parentheses. This is useful for long lines and long ternary operators. Minimal example:
pt_br: As variáveis podem ter várias linhas sem “escapar” delas ou usar parênteses. Isso é útil para linhas longas e operadores ternários longos. Exemplo mínimo:

source: This works with function calls too:
pt_br: Isso também funciona com chamadas de função:

source: You can use underscores, new lines, and whitespace in variable names:
pt_br: Você pode usar sublinhados, novas linhas (new lines) e espaços em branco nos nomes das variáveis:

source: [You can use reserved keywords as variable names.](https://nim-lang.github.io/Nim/manual.html#lexical-analysis-stropping)
pt_br: [Você pode usar palavras-chave reservadas como nomes de variáveis.](https://nim-lang.github.io/Nim/manual.html#lexical-analysis-stropping)

source: It's okay to use `var` while learning Nim or for quick prototyping, although it's much better to learn the difference between different variable declarations.
pt_br: Não há problema em usar `var` enquanto aprende Nim ou para prototipagem rápida, embora seja muito melhor aprender a diferença entre diferentes declarações de variáveis.

source: Consistent Spacing
pt_br: Espaçamento consistente

source: Spaces must be consistent on your code, mainly around operators:
pt_br: Os espaços devem ser consistentes em seu código, principalmente em torno dos operadores:

source: Bad inconsistent spaces:
pt_br: Espaços inconsistentes incorretos:

source: Omitting spaces on your code has no effect on performance.
pt_br: Omitir espaços em seu código não afeta o desempenho.

source: All operators are functions in Nim.
pt_br: Todos os operadores são funções no Nim.

source: Scoping
pt_br: Escopo

source: Scope "leaks", "bugs", "glitches", etc.
pt_br: Escopo: “vazamentos”, “bugs”, “falhas”, etc.

source: Output:
pt_br: Saída:

source: Note that in the example above we use a simple `int`, so the problem may not seem severe. But if `x` were a few gigabytes of RAM in size, it would "leak" out of the `for` loop to the rest of the outer or main scope instead of being reclaimed. Nim avoids this problem.
pt_br: Observe que, no exemplo acima, usamos um simples `int`, então o problema pode não parecer grave. Mas se `x` tivesse alguns gigabytes de RAM, ele “vazaria” do loop `for` para o resto do escopo externo ou principal, em vez de ser recuperado. Nim evita esse problema.

source: Another example:
pt_br: Outro exemplo:

source: Boolean conditionals
pt_br: Condicionais booleanos

source: Boolean comparisons "bugs", "glitches", etc.
pt_br: Comparações booleanas “bugs”, “falhas”, etc.

source: Fails with the error:
pt_br: Falha com o erro:

source: The Nim example compiles and runs without incident; the operator precedence is resolved correctly:
pt_br: O exemplo do Nim é compilado e executado sem incidentes; a precedência do operador é resolvida corretamente:

source: This runs because `bool` is a subtype of `int` in Python, so it supports the same mathematical operations. In Nim this is not the case:
pt_br: Isso é executado porque `bool` é um subtipo de `int` em Python, portanto, ele suporta as mesmas operações matemáticas. Em Nim, esse não é o caso:

source: Does not Compile:
pt_br: Não compila:

source: block
pt_br: bloco

source: `block` explicitly creates a new scope, without the overhead of a function. It can have a "name" without the name polluting the local namespace, and can be interrupted anywhere without requiring `return`.
pt_br: `block` cria explicitamente um novo escopo, sem a sobrecarga de uma função. Ele pode ter um “nome” sem que o nome polua o namespace local e pode ser interrompido em qualquer lugar sem exigir `retornar`.

source: `block` can be used with `var`, `let` and `const` too.
pt_br: `block` também pode ser usado com `var`, `let` e `const`.

source: Imagine that you need to get out of a nested `if`, without executing any other code from other `if` and `else` blocks. You can do:
pt_br: Imagine que você precise sair de um `if` aninhado, sem executar nenhum outro código de outros blocos `if` e `else`. Você pode fazer:

source: Mutable arguments
pt_br: Argumentos mutáveis

source: Imports
pt_br: Importações

source: Import
pt_br: Importar

source: **`import std/math` (recommended)**
pt_br: **`import std/math` (recomendado) **

source: **`import math` (recommended)**
pt_br: **`import math` (recomendado) **

source: "import as" another name
pt_br: “importar as” outro nome

source: `import math as potato`
pt_br: `import math as batata`

source: `import std/math as potato`
pt_br: `import std/math as batata`

source: Both of the above at the same time
pt_br: Ambos os itens acima ao mesmo tempo

source: All symbols except several, use unqualified
pt_br: Todos os símbolos, exceto vários, usam sem qualificação

source: Include another module in this module
pt_br: Incluir outro módulo neste módulo

source: **Your modules and types are not going to collide!, even if you have types named like modules, just chill and keep coding...**
pt_br: **Seus módulos e tipos não vão colidir! , mesmo que você tenha tipos chamados de módulos, relaxe e continue codificando... **

source: In Nim, `import std/math` imports all of the symbols from the `math` module (`sin`, `cos`, etc) so that they can be used unqualified. The Python equivalent is `from math import *`.
pt_br: No Nim, `import std/math` importa todos os símbolos do módulo `math` (`sin`, `cos`, etc) para que eles possam ser usados sem qualificação. O equivalente em Python é `from math import *`.

source: If you prefer to not import all the symbols, and always use qualified names instead, the Nim code is `from std/math import nil`. Then you can call `math.sin()`, `math.cos()`, etc. The Python equivalent is `import math`.
pt_br: Se você preferir não importar todos os símbolos e sempre usar nomes qualificados, o código Nim é `from std/math import nil`. Então você pode chamar `math.sin () `, `math.cos ()`, etc. O equivalente em Python é `import math`.

source: It is generally safe to import all names in Nim because the compiler will not actually compile any unused functions (so there's no overhead). Furthermore, since Nim is statically typed, it can usually distinguish between the two imported functions with the same names based on the types of the arguments they are called with. In the rare cases where the types are the same, you can still fully qualify the name to disambiguate.
pt_br: Geralmente, é seguro importar todos os nomes no Nim porque o compilador não compilará nenhuma função não utilizada (portanto, não há sobrecarga). Além disso, como o Nim é estaticamente tipado, ele geralmente pode distinguir entre as duas funções importadas com os mesmos nomes com base nos tipos de argumentos com os quais são chamadas. Nos raros casos em que os tipos são iguais, você ainda pode qualificar totalmente o nome para desambiguar.

source: The prefix `std/` enforces that the module is imported from the standard library. If a Nimble package has a module with the same name, the compiler can resolve the ambiguity and it is explicit in the code.
pt_br: O prefixo `std/` impõe que o módulo seja importado da biblioteca padrão. Se um pacote Nimble tiver um módulo com o mesmo nome, o compilador pode resolver a ambiguidade e isso está explícito no código.

source: Local modules and Nimble modules do not need `std/` prefix.
pt_br: Módulos locais e módulos Nimble não precisam do prefixo `std/`.

source: Python and Nim share these import statements:
pt_br: Python e Nim compartilham essas declarações de importação:

source: Alternative syntaxes:
pt_br: Sintaxes alternativas:

source: The variant with one `import` statement per line is common in Python and Nim, but in Nim the form `import foo, bar, baz` is also seen often.
pt_br: A variante com uma instrução `import` por linha é comum em Python e Nim, mas em Nim a forma `import foo, bar, baz` também é vista com frequência.

source: More examples:
pt_br: Mais exemplos:

source: Programatically
pt_br: Programaticamente

source: Code without imports
pt_br: Código sem importações

source: Sometimes in the wild you may see code samples or files **without** the imports but they somehow work anyway. The reason is that Nim can use `import` from the compile command, or from a `.nims` file:
pt_br: Às vezes, na natureza, você pode ver exemplos de código ou arquivos **sem** as importações, mas eles de alguma forma funcionam de qualquer maneira. O motivo é que Nim pode usar `import` do comando compile ou de um arquivo `.nims`:
