Repository: lskbr/nim_for_python_programmers
Catalog: locale/*/LC_MESSAGES/Nim-for-Python-Programmers.po
Languages: pt_br

source: Sometimes projects or quick code examples use this to save some typing. Thanks to Dead Code Elimination, if the imported symbols are not used they will not exist on the compiled output.
pt_br: Às vezes, projetos ou exemplos de código rápido usam isso para evitar a digitação. Graças ao Dead Code Elimination (Eliminação de código morto), se os símbolos importados não forem usados, eles não existirão na saída compilada.

source: See also:
pt_br: Veja também:

source: [Nim Command line switches](https://nim-lang.github.io/Nim/nimc.html#compiler-usage-command-line-switches)
pt_br: [Interruptores de linha de comando Nim](https://nim-lang.github.io/Nim/nimc.html#compiler-usage-command-line-switches)

source: Prelude
pt_br: Prelúdio

source: Sometimes you may feel that Python has more symbols available by default without any `import` compared to Nim. To get a similar experience of having the basic data structures and most common imports ready so you can get coding right away, you can use [prelude](https://nim-lang.github.io/Nim/prelude.html):
pt_br: Às vezes, você pode achar que o Python tem mais símbolos disponíveis por padrão sem qualquer `importação` em comparação com o Nim. Para ter uma experiência semelhante de ter as estruturas básicas de dados e as importações mais comuns prontas para que você possa começar a codificar imediatamente, você pode usar [prelude](https://nim-lang.github.io/Nim/prelude.html):

source: [prelude](https://nim-lang.github.io/Nim/prelude.html) is an [`include` file](https://nim-lang.github.io/Nim/manual.html#modules-include-statement) that simply imports common modules for your convenience, to save some typing. [prelude](https://nim-lang.github.io/Nim/prelude.html) works for JavaScript target too.
pt_br: [prelude](https://nim-lang.github.io/Nim/prelude.html) é um arquivo [`include`](https://nim-lang.github.io/Nim/manual.html#modules-include-statement) que simplesmente importa módulos comuns para sua conveniência, para evitar a digitação. [prelúdio](https://nim-lang.github.io/Nim/prelude.html) também funciona para destinos em JavaScript.

source: Where Symbols come from?
pt_br: De onde vêm os símbolos?

source: If symbols are unqualified, how do you know where symbols come from?
pt_br: Se os símbolos não são qualificados, como você sabe de onde vêm os símbolos?

source: Given `foo()` is a symbol:
pt_br: Dado que `foo () `é um símbolo:

source: Nim: you typically have `foo()`, [with UFCS support](https://en.wikipedia.org/wiki/Uniform_Function_Call_Syntax#Nim_programming_language).
pt_br: Nota: você normalmente tem `foo () `, [com suporte do UFCS](https://en.wikipedia.org/wiki/Uniform_Function_Call_Syntax#Nim_programming_language).

source: Python: you typically have `object.foo()` rather than `module.foo()`, no UFCS.
pt_br: Python: você normalmente tem `object.foo () `em vez de `module.foo ()`, sem UFCS.

source: Typically the [Editor/IDE](https://marketplace.visualstudio.com/items?itemName=kosz78.nim) should hint where the symbols come from, like in any other programming language:
pt_br: Normalmente, o [Editor/IDE](https://marketplace.visualstudio.com/items?itemName=kosz78.nim) deve sugerir de onde vêm os símbolos, como em qualquer outra linguagem de programação:

source: Nim comes built-in with [NimSuggest](https://nim-lang.org/docs/nimsuggest.html) for Editor/IDE integrations.
pt_br: O Nim vem integrado com o [NimSuggest](https://nim-lang.org/docs/nimsuggest.html) para integrações de editor/IDE.

source: Contrary to Python, Nim's type system has all the information about all of the symbols:
pt_br: Ao contrário do Python, o sistema de tipos de Nim tem todas as informações sobre todos os símbolos:

source: `echo` comes from:
pt_br: `echo` vem de:

source: When learning Nim, or for quick prototyping, it is okay to use the symbols fully qualified. Doing so produces no errors, but idiomatic Nim avoids this.
pt_br: Ao aprender Nim ou para prototipagem rápida, não há problema em usar os símbolos totalmente qualificados. Fazer isso não produz erros, mas o Nim idiomático evita isso.

source: In Python all symbols in the module are visible and mutable from modules that import it, including symbols that should not be used or mutated outside the module.
pt_br: Em Python, todos os símbolos no módulo são visíveis e mutáveis dos módulos que o importam, incluindo símbolos que não devem ser usados ou alterados fora do módulo.

source: In Nim everything is private by default and therefore is not visible from other modules. To make symbols public and visible in other modules, you have to use the asterisk `*`:
pt_br: No Nim, tudo é privado por padrão e, portanto, não é visível em outros módulos. Para tornar os símbolos públicos e visíveis em outros módulos, você precisa usar o asterisco `*`:

source: The asterisk not only makes the symbol visible to the outside world, the symbol will also appear in the generated documentation (`nim doc`). When you import the module, the symbol will be automatically added to the namespace, but private (not exported) symbols without `*` will not be visible. The asterisk is like a **visual cue** for humans. You can immediately understand what symbols are a part of the "the public API" just by looking at the module's source code. The asterisk `*` is pronounced as "star".
pt_br: O asterisco não apenas torna o símbolo visível para o mundo exterior, mas também aparecerá na documentação gerada (`nim doc`). Quando você importa o módulo, o símbolo será automaticamente adicionado ao namespace, mas símbolos privados (não exportados) sem `*` não estarão visíveis. O asterisco é como uma **dica visual** para humanos. Você pode entender imediatamente quais símbolos fazem parte da “API pública” apenas examinando o código-fonte do módulo. O asterisco `*` é pronunciado como “estrela”.

source: For more information, read: https://narimiran.github.io/2019/07/01/nim-import.html
pt_br: Para obter mais informações, leia: https://narimiran.github.io/2019/07/01/nim-import.html

source: In Python, imports are a runtime operation and can fail. It is a fairly common pattern that platform-dependent imports are placed inside a try block, and an alternative or fallback inside the except:
pt_br: Em Python, os imports são uma operação em tempo de execução e podem falhar. É um padrão bastante comum que os imports dependentes da plataforma sejam colocadas dentro de um bloco try e uma alternativa ou fallback dentro do bloco except:

source: Nim resolves all imports at compile-time, so something like an `ImportError` does not exist. There's no need to handle import errors at runtime.
pt_br: O Nim resolve todas as importações em tempo de compilação, então algo como um `ImportError` não existe. Não há necessidade de lidar com erros de importação em tempo de execução.

source: Arrays in Nim are fixed size, start at index `0`, and must contain elements of the same type.
pt_br: As matrizes em Nim são de tamanho fixo, começam no índice `0` e devem conter elementos do mesmo tipo.

source: When passing an array to a function in Nim, the argument is an immutable reference. Nim will include run-time checks on the bounds of the arrays.
pt_br: Ao passar uma matriz para uma função em Nim, o argumento é uma referência imutável. O Nim incluirá verificações em tempo de execução nos limites das matrizes.

source: You can use an [`openarray`](https://nim-lang.github.io/Nim/manual.html#types-open-arrays) to accept an array of any size on the function arguments, and you can use `low(your_array)` and `high(your_array)` to query the bounds of the array.
pt_br: Você pode usar um [`openarray`](https://nim-lang.github.io/Nim/manual.html#types-open-arrays) para aceitar uma matriz de qualquer tamanho nos argumentos da função, e você pode usar `low (seu_array) `e `high (seu_array)` para consultar os limites da matriz.

source: Nim `string` is compatible with `openArray[char]` to avoid unneeded copies for optimization, and `char` is compatible with `int`. Therefore `string` manipulation can be done with math in-place transparently. A function that takes `openArray[char]` accepts `"abcd"` *and* `['a', 'b', 'c', 'd']`.
pt_br: Nim `string` é compatível com `openArray [char] `para evitar cópias desnecessárias para otimização, e `char` é compatível com `int`. Portanto, a manipulação de `strings` pode ser feita com a matemática no local de forma transparente. Uma função que usa `openArray [char] `aceita `"abcd"` *e*` ['a', 'b', 'c', 'd'] `.

source: Array contents are always contiguous in memory, as are arrays of arrays.
pt_br: O conteúdo da matriz é sempre contíguo na memória, assim como as matrizes de matrizes.

source: [Views](https://nim-lang.github.io/Nim/manual_experimental.html#view-types)
pt_br: [Visualizações](https://nim-lang.github.io/Nim/manual_experimental.html#view-types)

source: Data Type Sizes
pt_br: Tamanhos dos tipos de dados

source: Whats the size of the different data types?.
pt_br: Qual é o tamanho dos diferentes tipos de dados?.

source: This is only an approximation for the empty primitives on 64-bit.
pt_br: Essa é apenas uma aproximação para as primitivas vazias em 64 bits.

source: Objects
pt_br: Objetos

source: Objects in Nim behave quite differently from classes in Python. Objects support inheritance and OOP. Classes are named types in Nim. Functions (procs) are free floating functions, not bound to objects (however, you can use them in a very similar way to Python). You can call a function on objects with the `object.function()` syntax as well as `function(object)`; [these are entirely equivalent](https://en.wikipedia.org/wiki/Uniform_Function_Call_Syntax). Nim does not have an implicit `self` nor `this`. It is best practice to put all your types near the top of the file, but this is not mandatory.
pt_br: Objetos em Nim se comportam de forma bem diferente das classes em Python. Os objetos suportam herança e OOP. As classes são denominadas tipos em Nim. Funções (procs) são funções flutuantes livres, não vinculadas a objetos (no entanto, você pode usá-las de uma forma muito semelhante ao Python). Você pode chamar uma função em objetos com a sintaxe `object.function () `, bem como `function (object)`; [estes são totalmente equivalentes](https://en.wikipedia.org/wiki/Uniform_Function_Call_Syntax). Nim não tem um `eu` implícito nem `isso`. É uma boa prática colocar todos os tipos no topo do arquivo, mas isso não é obrigatório.

source: A way to imagine this is that **procs get "glued" to the types of their arguments at compile-time**, and then you can use them at runtime as if they were Python classes and methods.
pt_br: Uma forma de imaginar isso é que **procs ficam “grudados” nos tipos de seus argumentos em tempo de compilação** e, em seguida, você pode usá-los em tempo de execução como se fossem classes e métodos do Python.

source: From Python to Nim, *as minimal as possible* example:
pt_br: Do Python ao Nim, *o mínimo possível* exemplo:

source: Minimal inheritance example:
pt_br: Exemplo de herança mínima:

source: Python-like object orientation examples:
pt_br: Exemplos de orientação de objetos semelhantes aos do Python:

source: Inheritance example:
pt_br: Exemplo de herança:

source: [Dynamic Typing via metaprogramming](https://github.com/Carpall/nobject#here-a-simple-object-for-allowing-dynamic-typing-in-nim)
pt_br: [Tipagem dinâmica via metaprogramação](https://github.com/Carpall/nobject#here-a-simple-object-for-allowing-dynamic-typing-in-nim)

source: After the Cat example you are probably wondering how to do `def __init__(self, arg):`.
pt_br: Depois do exemplo do Cat, você provavelmente está se perguntando como fazer `def __init__ (self, arg) :`.

source: Python `__init__()` is Nim `newObject()` or `initObject()`. Lets make an `__init__()` for the Cat:
pt_br: Python `__init__ () `é Nim `newObject ()` ou `initObject () `. Vamos fazer um `__init__ () `para o Cat:

source: Naming is a convention and best practice. When you want init for `Foo` just make `newFoo()` or `initFoo()`. As you may notice `initCat` is just a function that returns a `Cat`.
pt_br: A nomenclatura é uma convenção e uma boa prática. Quando você quiser init para `Foo`, basta criar `newFoo () `ou `initFoo ()`. Como você pode notar, `initCat` é apenas uma função que retorna um `Cat`.

source: `initFoo()` for `object`.
pt_br: `initFoo () `para `object`.

source: `newFoo()` for `ref object`.
pt_br: `newFoo () `para `ref object`.

source: [Read the documentation for Naming things following conventions and best practices.](https://nim-lang.org/docs/apis.html)
pt_br: [Leia a documentação para nomear coisas seguindo as convenções e as melhores práticas.](https://nim-lang.org/docs/apis.html)

source: Object Attribute Default Values
pt_br: Valores padrão do atributo do objeto

source: The object constructor is also the way to set custom default values to the attributes of your objects:
pt_br: O construtor de objetos também é a forma de definir valores padrão personalizados para os atributos de seus objetos:

source: A more complete structure for a basic program can be something like:
pt_br: Uma estrutura mais completa para um programa básico pode ser algo como:

source: Run-time Code Expansion
pt_br: Expansão do código de execução

source: Python objects that *internally* use code generation are very very slow, scaling with size. The more you use it the slower it runs. `dataclass`, `metaclass`, decorators, etc can be more than 25 ~ 50x slower than a normal `class`. [`pathlib.Path` and its methods can be more than 25 ~ 50x slower than a normal `str`](https://youtu.be/tFrh9hKMS6Y), and defeats any optimization, including a `.pyc` file. Cython does not have CTFE, so it does not help with this specifically.
pt_br: Objetos Python que *internamente* usam geração de código são muito, muito lentos, escalonando com o tamanho. Quanto mais você o usa, mais lento ele executa. `dataclass`, `metaclasse`, decoradores, etc. podem ser mais de 25 ~ 50x mais lentos do que uma `classe` normal. [`Pathlib.path` e seus métodos podem ser mais de 25 ~ 50x mais lentos do que um `str`] normal (https://youtu.be/tFrh9hKMS6Y) e anulam qualquer otimização, incluindo um arquivo `.pyc`. O Cython não tem CTFE, então isso não ajuda especificamente.

source: Nim code expansion is done at compile-time, making its code generation zero cost at run-time.
pt_br: A expansão do código Nim é feita em tempo de compilação, tornando seu custo de geração de código zero em tempo de execução.

source: For example, you can see the result of ARC code expansion during compilation using `--expandArc`. This is how Nim does compile-time memory management (approximation):
pt_br: Por exemplo, você pode ver o resultado da expansão do código ARC durante a compilação usando `—expandArc`. É assim que o Nim faz o gerenciamento de memória em tempo de compilação (aproximação):

source: [`macros.expandMacros` shows you the code expansion on the terminal during compilation](https://nim-lang.github.io/Nim/macros.html#expandMacros.m%2Ctyped)
pt_br: [`Macros.expandMacros` mostra a expansão do código no terminal durante a compilação](https://nim-lang.github.io/Nim/macros.html#expandMacros.m%2Ctyped)

source: Unsafe Type Hints
pt_br: Unsafe Type Hints (dicas de tipagem inseguras)

source: Python "type hints" can be almost anything and are implicitly executed at run-time. Needless to say, this can be very unsafe:
pt_br: As “type hints” do Python podem ser quase qualquer coisa e são executadas implicitamente em tempo de execução. Não é preciso dizer que isso pode ser muito inseguro:

source: Nim types must be a valid Nim type, types are type checked at compile-time:
pt_br: Os tipos de Nim devem ser válidos; os tipos são verificados no momento da compilação:

source: Another example
pt_br: Outro exemplo

source: By-Value vs By-Reference
pt_br: Por valor x por referência

source: Does Nim passes data around "by value" or "by reference"? It depends ...
pt_br: Nim transmite dados “por valor” ou “por referência”? Depende...

source: The Nim compiler automatically determines whether a parameter is passed by-value or by-reference based on the parameter type's size.
pt_br: O compilador Nim determina automaticamente se um parâmetro é passado por valor ou por referência com base no tamanho do tipo de parâmetro.

source: If a parameter must be passed by-value or by-reference (such as when interfacing with a C library), then use the `{.bycopy.}` or `{.byref.}` pragmas.
pt_br: Se um parâmetro precisar ser passado por valor ou por referência (como ao fazer interface com uma biblioteca C), use os pragmas `{.bycopy.}` ou `{.byref.}`.

source: **Nim passes objects larger than `3 * sizeOf(int)` by reference for performance**, but this is architecture and implementation defined. So the following information is just an *approximation* for `x86_64`:
pt_br: **Nim passa objetos maiores que `3 * sizeOf (int) `por referência para desempenho**, mas isso é arquitetura e implementação definidas. Portanto, as informações a seguir são apenas uma *aproximação* para `x86_64`:

source: Declaration
pt_br: Declaração

source: Value or Reference?
pt_br: Valor ou referência?

source: Implicit or Explicit?
pt_br: Implícito ou explícito?

source: Managed or Unmanaged?
pt_br: Gerenciado ou não gerenciado?

source: Observations
pt_br: Observações

source: By value
pt_br: Por valor

source: Implicit
pt_br: Implícito

source: Managed
pt_br: Gerenciado

source: Frequent use
pt_br: Uso frequente

source: By reference
pt_br: Por referência

source: Explicit
pt_br: Explícito

source: Rare
pt_br: Raro

source: Unmanaged
pt_br: Não gerenciado

source: Unmanaged Pointer
pt_br: Ponteiro não gerenciado

source: Iff a "by value" symbol is big, then it is passed "by reference" automatically.
pt_br: Se um símbolo “por valor” for grande, ele será transmitido “por referência” automaticamente.

source: [You can disable this optimization using `{.bycopy.}` pragma on the symbol.](https://nim-lang.github.io/Nim/manual.html#foreign-function-interface-bycopy-pragma)
pt_br: [Você pode desativar essa otimização usando o pragma `{.bycopy.}` no símbolo.](https://nim-lang.github.io/Nim/manual.html#foreign-function-interface-bycopy-pragma)

source: [The `{.byref.}` forces passing "by reference", the reverse of `{.bycopy.}`.](https://nim-lang.github.io/Nim/manual.html#foreign-function-interface-byref-pragma)
pt_br: [O `{.byref.}` força a passagem “por referência”, o inverso de `{.bycopy.}`.](https://nim-lang.github.io/Nim/manual.html#foreign-function-interface-byref-pragma)

source: Nim `seq` is passed around "by reference" by default.
pt_br: Nim `seq` é passado “por referência” por padrão.

source: Nim `string` is [Copy-On-Write](https://en.wikipedia.org/wiki/Copy-on-write) COW (ARC/ORC).
pt_br: Sua `string` é [Copy-On-Write](https://en.wikipedia.org/wiki/Copy-on-write) COW (ARC/ORC).

source: Ranges
pt_br: Intervalos

source: In Python, simple integer for loops use the `range` generator function. For the 1- and 2- argument forms of this function, nim's [`..` iterator](https://nim-lang.org/docs/system.html#...i%2CT%2CT) works almost the same way:
pt_br: Em Python, um número inteiro simples para loops usa a função geradora `range`. Para as formas de argumento 1 e 2 dessa função, o [`..` iterator](https://nim-lang.org/docs/system.html#...i%2CT%2CT) de nim funciona quase da mesma maneira:

source: Note that the `..` operator includes the end of the range, whereas Python's `range(a, b)` does not include `b`. If you prefer this behavior, use the [`..<` iterator](https://nim-lang.org/docs/system.html#..%3C.i%2CT%2CT) instead:
pt_br: Observe que o operador `..` inclui o final do intervalo, enquanto o `range (a, b) `do Python não inclui `b`. Se você preferir esse comportamento, use o iterador [`.. <`](https://nim-lang.org/docs/system.html#..%3C.i%2CT%2CT) em vez disso:

source: Python `range()` also has an optional third parameter, which is the value to increment by each step. This can be positive or negative. If you need this behavior, use the [`countup`](https://nim-lang.org/docs/system.html#countup.i%2CT%2CT%2CPositive) or [`countdown`](https://nim-lang.org/docs/system.html#countdown.i%2CT%2CT%2CPositive) iterators:
pt_br: O `range () `do Python também tem um terceiro parâmetro opcional, que é o valor a ser incrementado em cada etapa. Isso pode ser positivo ou negativo. Se você precisar desse comportamento, use os iteradores [`countup`](https://nim-lang.org/docs/system.html#countup.i%2CT%2CT%2CPositive) ou [`countdown`](https://nim-lang.org/docs/system.html#countdown.i%2CT%2CT%2CPositive):

source: Convert from `range` to `seq`:
pt_br: Converta de `range` para `seq`:

source: Slices
pt_br: Fatias

source: The syntax for slice ranges is different. Python's `a[x:y]` is Nim's `a[x ..< y]`.
pt_br: A sintaxe dos intervalos de fatias é diferente. `a [x:y] `do Python é `a [x.. < y]` de Nim.

source: Reverse Index Slices
pt_br: Fatias de índice reverso

source: In Nim a reverse index or backwards index uses `^` with the number, like `^1`. Backwards indexes have a specific type `BackwardsIndex`, and they can also be "prepared" at compile-time as a `const`:
pt_br: Em Nim, um índice reverso ou índice inverso usa `^` com o número, como `^1`. Os índices retroativos têm um tipo específico `backwardsIndex` e também podem ser “preparados” em tempo de compilação como `const`:

source: Static Bounds-Check
pt_br: Verificação estática de limites

source: Nim has [static bounds-checking at compile-time.](https://en.wikipedia.org/wiki/Static_program_analysis)
pt_br: Nim tem [verificação estática de limites em tempo de compilação.](https://en.wikipedia.org/wiki/Static_program_analysis)

source: Lets compare very simplified examples:
pt_br: Vamos comparar exemplos muito simplificados:

source: This crashes at run-time because there is no index 9:
pt_br: Isso falha em tempo de execução porque não há índice 9:

source: Let's see Nim:
pt_br: Vamos ver Nim:

source: Compile and run:
pt_br: Compile e execute:

source: Nim checks at compile-time that `[0, 1, 2]` has no index `9`, because `9 > 2`. Therefore, it won't compile nor run.
pt_br: Nim verifica em tempo de compilação que `[0, 1, 2]` não tem índice `9`, porque `9 > 2`. Portanto, ele não será compilado nem executado.

source: This also works with Subrange. Let's say you have a integer variable that **must be positive**:
pt_br: Isso também funciona com o Subrange. Digamos que você tenha uma variável inteira que **deva ser positiva**:

source: Nim checks at compile-time that `must_be_positive` is not `Positive` because `1 > -9`. It won't compile nor run.
pt_br: Nim verifica em tempo de compilação se `must_be_positive` não é `Positivo` porque `1 > -9`. Ele não será compilado nem executado.

source: You can control this with `--staticBoundChecks:on` or `--staticBoundChecks:off`.
pt_br: Você pode controlar isso com `—staticBoundChecks:on` ou `—staticBoundChecks:off`.

source: With `--staticBoundChecks:off` it may raise an error at run-time like Python does.
pt_br: Com `—staticBoundChecks:off`, isso pode gerar um erro em tempo de execução, como o Python faz.

source: For better documentation see: https://nim-lang.github.io/Nim/drnim.html
pt_br: Para obter uma documentação melhor, consulte: https://nim-lang.github.io/Nim/drnim.html

source: Null Coalescing
pt_br: Coalescência nula

source: Python does not have a [null-coalescing operator](https://en.wikipedia.org/wiki/Null_coalescing_operator) (at the time of writing).
pt_br: O Python não tem um [operador de coalescência nula](https://en.wikipedia.org/wiki/Null_coalescing_operator) (no momento em que este artigo foi escrito).

source: Python programmers use the ternary conditional operator instead:
pt_br: Em vez disso, os programadores de Python usam o operador condicional ternário:
