Repository: lskbr/nim_for_python_programmers
Catalog: locale/*/LC_MESSAGES/Nim-for-Python-Programmers.po
Languages: pt_br

source: [The Nimble package manager can also run Unittests.](https://github.com/nim-lang/nimble#nimble-tasks)
pt_br: [O gerenciador de pacotes Nimble também pode executar Unittests.](https://github.com/nim-lang/nimble#nimble-tasks)

source: [NimScript can also run Unittests.](https://nim-lang.org/docs/nims.html)
pt_br: [O NIMScript também pode executar Unittests.](https://nim-lang.org/docs/nims.html)

source: [You can run documentation as Unittests with `runnableExamples`](https://nim-lang.org/docs/system.html#runnableExamples%2Cuntyped).
pt_br: [Você pode executar a documentação como Unittests com `runnableExamples`](https://nim-lang.org/docs/system.html#runnableExamples%2Cuntyped).

source: Assert with customized messages
pt_br: Assert com mensagens personalizadas

source: `assert` can take a `block`. You can customize the message for better user experience:
pt_br: `assert` pode ter um `block`. Você pode personalizar a mensagem para melhorar a experiência do usuário:

source: Testament
pt_br: Testamento

source: An alternative to `unittest`. It is prepared for big projects and has more features.
pt_br: Uma alternativa ao `unittest`. Está preparado para grandes projetos e tem mais funcionalidades.

source: https://nim-lang.github.io/Nim/testament.html **(Recommended)**
pt_br: https://nim-lang.github.io/Nim/testament.html ** (Recomendado) **

source: Docstrings in Nim are ReSTructuredText *and* MarkDown comments starting with `##`. ReSTructuredText and MarkDown can be mixed together if you want.
pt_br: Docstrings em Nim são comentários reStructuredText *e* MarkDown começando com `##`. ReStructuredText e MarkDown podem ser misturados, se você quiser.

source: Generate HTML, Latex (PDF) and JSON documentation from source code with `nim doc file.nim`.
pt_br: Gere documentação HTML, Latex (PDF) e JSON a partir do código-fonte com `nim doc file.nim`.

source: Nim can generate a dependency graph DOT `.dot` file with `nim genDepend file.nim`.
pt_br: O Nim pode gerar um gráfico de dependência DOT `.dot` com `nim genDepend file.nim`.

source: Optional Indentation
pt_br: Indentação opcional

source: You can write constructs like `if..then` and `try..except..finally` on a single line without errors or warnings; indentation is optional. Obviously, this is only a good idea if the snippet is short and simple.
pt_br: Você pode escrever construções como `if.. then` e `try.. except.. finally` em uma única linha sem erros ou avisos; a indentação é opcional. Obviamente, isso só é uma boa ideia se o trecho for curto e simples.

source: Why is Nim CamelCase instead of snake_case?.
pt_br: Por que Nim CamelCase em vez de snake_case?

source: It really isn't, Nim is style-agnostic!
pt_br: Realmente não é, Nim é independente de estilo!

source: **This feature allows Nim to seamlessly interoperate with a lot of programming languages with different casing styles.**
pt_br: **Esse recurso permite que o Nim interopere perfeitamente com várias linguagens de programação com diferentes estilos de nomeação. **

source: For more homogeneous code you can enforce a default casing style using the compiler command `--styleCheck:hint`. Nim will *style check* your code before compilation, similar to `pycodestyle` in Python. If you want even more strict styling you can use `--styleCheck:error`.
pt_br: Para obter um código mais homogêneo, você pode aplicar um estilo de caixa padrão usando o comando do compilador `—styleCheck:hint`. Nim *verificará o estilo* do seu código antes da compilação, semelhante ao `pycodestyle` em Python. Se você quiser um estilo ainda mais rígido, você pode usar `—styleCheck:error`.

source: Nim comes with a builtin code auto-formatter named Nimpretty.
pt_br: O Nim vem com um formatador automático de código embutido chamado Nimpretty.

source: A lot of programming languages have some kind of case-insensitivity, such as: PowerShell, SQL, PHP, Lisp, Assembly, Batch, ABAP, Ada, Visual Basic, VB.NET, Fortran, Pascal, Forth, Cobol, Scheme, Red, Rebol.
pt_br: Muitas linguagens de programação não diferenciam maiúsculas e minúsculas, como: PowerShell, SQL, PHP, Lisp, Assembly, Batch, ABAP, Ada, Visual Basic, VB.NET, Fortran, Pascal, Forth, Cobol, Scheme, Red, Rebol.

source: If you are just starting from scratch, you can use Python-like names while learning. It will not produce an error unless you tell the compiler you want that.
pt_br: Se você está começando do zero, pode usar nomes semelhantes aos do Python enquanto aprende. Isso não produzirá um erro, a menos que você diga ao compilador que deseja isso.

source: def vs proc/func
pt_br: def x proc/func

source: Why doesn't Nim use `def` instead of `proc`?.
pt_br: Por que Nim não usa `def` em vez de `proc`?.

source: Nim uses `proc` for normal functions, which is short for "procedure".
pt_br: Nim usa `proc` para funções normais, que é a abreviação de “procedimento”.

source: Use `func` for when your routine cannot and should not access global or thread-local variables (see also: [pure functions](https://en.wikipedia.org/wiki/Pure_function)).
pt_br: Use `func` para quando sua rotina não puder e não deve acessar variáveis globais ou locais de thread (veja também: [funções puras](https://en.wikipedia.org/wiki/Pure_function)).

source: [Nim has side-effects tracking.](https://nim-lang.github.io/Nim/manual.html#procedures-func)
pt_br: [Nim tem rastreamento de efeitos colaterais.](https://nim-lang.github.io/Nim/manual.html#procedures-func)

source: You can not use `echo` inside `func`, because `echo` mutates `stdout`, which is a side-effect. Use `debugEcho` instead.
pt_br: Você não pode usar `echo` dentro de `func`, porque `echo` muda `stdout`, o que é um efeito colateral. Em vez disso, use `debugEcho`.

source: [Strict Func](https://nim-lang.github.io/Nim/manual_experimental.html#strict-funcs)
pt_br: [Func restrito](https://nim-lang.github.io/Nim/manual_experimental.html#strict-funcs)

source: [Write Tracking for Nim](https://nim-lang.org/araq/writetracking_2.html)
pt_br: [Rastreamento de gravação para Nim](https://nim-lang.org/araq/writetracking_2.html)

source: If you are just starting from scratch, you can use `proc` for all the functions while learning. It will not produce an error for doing so.
pt_br: Se você está começando do zero, você pode usar `proc` para todas as funções enquanto aprende. Isso não dará um erro.

source: Nim has had async built-in for a long time. It works as you may expect with `async`, `await`, `Future`, etc.
pt_br: O Nim tem a assíncrona embutida há muito tempo. Funciona como você pode esperar com `async`, `await`, `Future`, etc.

source: [asyncdispatch](https://nim-lang.org/docs/asyncdispatch.html) is a module to write concurrent code using the `async`/`await` syntax.
pt_br: [asyncdispatch](https://nim-lang.org/docs/asyncdispatch.html) é um módulo para escrever código simultâneo usando a sintaxe `async`/`await`.

source: `Future` is a type (like a Future in Python, or a Promise in JavaScript).
pt_br: `Future` é um tipo (como uma Future em Python ou uma Promise em JavaScript).

source: `{.async.}` is a pragma that converts functions to async (like `async def` in Python).
pt_br: `{.async.}` é um pragma que converte funções em assíncronas (como `async def` em Python).

source: Let's convert the official Python asyncio *Hello World* to Nim:
pt_br: Vamos converter o asyncio oficial do Python *Hello World* para Nim:

source: Internally async is implemented using metaprogramming (macros, templates, pragmas, etc).
pt_br: A assíncrona interna é implementada usando metaprogramação (macros, modelos, pragmas, etc.).

source: Description
pt_br: Descrição

source: Waits for the Future to complete
pt_br: Espera que a Future seja concluída

source: Ignores the Future
pt_br: Ignora a Future

source: Returns result inside Future
pt_br: Retorna o resultado da Future

source: Only available inside async
pt_br: Disponível apenas dentro do async

source: Why doesn't Nim use `async def`?.
pt_br: Por que Nim não usa `async def`?.

source: Async is just a `macro` in Nim, no need to change the syntax of the language. It is like a decorator in Python, only more powerful.
pt_br: Async é apenas uma `macro` em Nim, sem necessidade de alterar a sintaxe da linguagem. É como um decorador em Python, só que mais poderoso.

source: Also in Nim the same function can be asynchronous *and* synchronous at the same time, with the same code, with the same name.
pt_br: Também no Nim, a mesma função pode ser assíncrona *e* síncrona ao mesmo tempo, com o mesmo código, com o mesmo nome.

source: In Python when you have a library *"foo"*, you may need both `foo` (sync) and `aiofoo` (async), which are usually completely different projects, repos, developers and APIs. This is not needed in Nim, or rarely seen, thanks to said feature.
pt_br: Em Python, quando você tem uma biblioteca *"foo"*, você pode precisar de `foo` (sync) e `aiofoo` (async), que geralmente estão em projetos, repositórios, desenvolvedores e APIs completamente diferentes. Isso não é necessário no Nim, ou raramente visto, graças a esse recurso.

source: [Because async is just a `macro` in Nim you can create your own async your way too.](https://github.com/disruptek/cps#why)
pt_br: [Como o async é apenas uma `macro` no Nim, você também pode criar seu próprio assíncrono do seu jeito.](https://github.com/disruptek/cps#why)

source: See also [asyncfile](https://nim-lang.org/docs/asyncfile.html), [asyncnet](https://nim-lang.org/docs/asyncnet.html), [asyncstreams](https://nim-lang.org/docs/asyncstreams.html), [asyncftpclient](https://nim-lang.org/docs/asyncftpclient.html), [asyncfutures](https://nim-lang.org/docs/asyncfutures.html).
pt_br: Veja também [asyncfile](https://nim-lang.org/docs/asyncfile.html), [asyncnet](https://nim-lang.org/docs/asyncnet.html), [asyncstreams](https://nim-lang.org/docs/asyncstreams.html), [asyncftpclient](https://nim-lang.org/docs/asyncftpclient.html), [asyncfutures](https://nim-lang.org/docs/asyncfutures.html).

source: Do I have to know C?
pt_br: Eu tenho que saber C?

source: You never have to actually manually edit C, the same way in Python you never manually edit the .pyc files.
pt_br: Você nunca precisa realmente editar manualmente o C, da mesma forma que no Python você nunca edita manualmente os arquivos .pyc.

source: In Nim you code by writing Nim, the same way in Python you code by writing Python.
pt_br: No Nim, você codifica escrevendo Nim, da mesma forma que em Python você codifica escrevendo Python.

source: Templates
pt_br: Modelos (Templates)

source: A template replaces its invocation with the template body at compile-time.
pt_br: Um modelo substitui sua invocação pelo corpo do modelo em tempo de compilação.

source: Essentially, **the compiler will copy and paste a chunk of code for you**.
pt_br: Essencialmente, **o compilador copiará e colará um pedaço de código para você**.

source: A template allows us to have a function-like constructs without any overhead, or to split huge functions into smaller parts.
pt_br: Um modelo nos permite ter construções semelhantes a uma função sem qualquer sobrecarga ou dividir funções enormes em partes menores.

source: Too many function and variable names may pollute the local namespace. Variables inside templates do not exist outside of their template. Templates do not exist in the namespace at run-time (if you do not export them), Templates may optimize certain values if they are known at compile-time.
pt_br: Muitos nomes de funções e variáveis podem poluir o namespace local. As variáveis dentro dos modelos não existem fora do modelo. Os modelos não existem no namespace em tempo de execução (se você não os exportar). Os modelos podem otimizar determinados valores se forem conhecidos em tempo de compilação.

source: Templates *cannot* do `import` nor `export` of libraries automatically implicitly. Templates do *not* "auto-import" symbols used inside itself. If you use any imported library on the body of a template, you must import that library when invoking that template.
pt_br: Os templates *não* podem `importar` nem `exportar` de bibliotecas automaticamente implicitamente. Os modelos *não* “importam automaticamente” símbolos usados dentro de si mesmos. Se você usar qualquer biblioteca importada no corpo de um modelo, deverá importar essa biblioteca ao invocar esse modelo.

source: Inside templates you can not use `return` because a template is not a function.
pt_br: Dentro dos modelos, você não pode usar `return` porque um modelo não é uma função.

source: Templates allow you to implement very high-level, beautiful APIs for everyday usage, while keeping the low-level optimized details out of your head and [DRY](https://en.wikipedia.org/wiki/Don%27t_repeat_yourself).
pt_br: Os modelos permitem que você implemente APIs bonitas e de alto nível para o uso diário, mantendo os detalhes otimizados de baixo nível fora de sua cabeça e [DRY](https://en.wikipedia.org/wiki/Don%27t_repeat_yourself).

source: Python `with open("file.txt", mode = "r") as file:` implemented using a template:
pt_br: Python `with open (” file.txt “, mode = “r”) as file:` implementado usando um modelo:

source: [![Template explanation animation](https://raw.githubusercontent.com/juancarlospaco/nim-presentation-slides/master/templates.gif "Template explanation animation")](https://github.com/juancarlospaco/nim-presentation-slides/blob/master/templates.xcf)
pt_br: [![Animação explicativa do modelo](https://raw.githubusercontent.com/juancarlospaco/nim-presentation-slides/master/templates.gif “Animação explicativa do modelo”)](https://github.com/juancarlospaco/nim-presentation-slides/blob/master/templates.xcf)

source: The GIF is not perfect, but a lazy simplified approximation!
pt_br: O GIF não é perfeito, mas uma aproximação preguiçosa e simplificada!

source: This is not the way to read files in Nim, just an exercise.
pt_br: Essa não é a maneira de ler arquivos no Nim, apenas um exercício.

source: This template is not perfect, but a lazy approximation. It is an exercise for the reader to try to improve it ;P
pt_br: Este modelo não é perfeito, mas uma aproximação preguiçosa. É um exercício para o leitor tentar melhorá-lo ;P

source: If you are just starting from scratch, do not worry, you can use functions for everything while learning.
pt_br: Se você está começando do zero, não se preocupe, você pode usar funções para tudo enquanto aprende.

source: How to share variables between functions?
pt_br: Como compartilhar variáveis entre funções?

source: Sharing variables between functions is similar to Python.
pt_br: O compartilhamento de variáveis entre funções é semelhante ao Python.

source: **Global variable:**
pt_br: **Variável global: **

source: **Object Attribute:**
pt_br: **Atributo do objeto: **

source: You can pass functions as arguments to other functions like in Python. Functions (procs) are first class objects.
pt_br: Você pode passar funções como argumentos para outras funções, como em Python. Funções (procs) são objetos de primeira classe.

source: In-Place vs Out-Place
pt_br: In-Place x Out-Place

source: If you are migrating from an interpreted language, like Python or JavaScript, you may find strange mentions of "In-Place" and "Out-Place" somewhere in Nim. If you don't know what it means then Nim looks like it has duplicated functions.
pt_br: Se você estiver migrando de uma linguagem interpretada, como Python ou JavaScript, você pode encontrar menções estranhas de “In-Place” e “Out-Place” em algum lugar de Nim. Se você não sabe o que isso significa, parece que o Nim tem funções duplicadas.

source: Python allocates a new string or object when something in it changes somehow. Let's say you have a huge string in a variable and you want to change a single character. Since Python strings are immutable, the only solution is to duplicate the string in memory but with the new copy having that character changed. Returning a new copy is an "Out-Place" operation. Most of Python works like this.
pt_br: O Python aloca uma nova string ou objeto quando algo nele muda de alguma forma. Digamos que você tenha uma sequência enorme em uma variável e queira alterar um único caractere. Como as cadeias de caracteres do Python são imutáveis, a única solução é duplicar a string na memória, mas com a nova cópia tendo esse caractere alterado. Devolver uma nova cópia é uma operação “Out-Place”. A maior parte do Python funciona assim.

source: On the other hand, Nim's strings are mutable. In Nim you can change only the character you want to change, rather than copying the string in memory. Some functions work in-place, some functions work on a new copy. The documentation will (usually) which.
pt_br: Por outro lado, as strings de Nim são mutáveis. No Nim, você pode alterar apenas o caractere que deseja alterar, em vez de copiar a string na memória. Algumas funções funcionam no local, outras funcionam em uma nova cópia. A documentação (geralmente) será qual.

source: [using `macro` Nim can turn from an in-place function to out-place one.](https://nim-lang.github.io/Nim/sugar.html#dup.m%2CT%2Cvarargs%5Buntyped%5D)
pt_br: [usando `macro`, o Nim pode passar de uma função in-place para uma out-place.](https://nim-lang.github.io/Nim/sugar.html#dup.m%2CT%2Cvarargs%5Buntyped%5D)

source: Nim stdlib modules designed for the JavaScript target usually work on a new copy. This is just how the JavaScript target is; there is no in-place API nor benefits from using it.
pt_br: Os módulos Nim stdlib projetados para o destino JavaScript geralmente funcionam em uma nova cópia. É assim que o destino do JavaScript é; não há API local nem benefícios em usá-la.

source: Some Nim stdlib modules that work on a new copy may or may not be changed to work in-place in the future.
pt_br: Alguns módulos Nim stdlib que funcionam em uma nova cópia podem ou não ser alterados para funcionar no local no futuro.

source: Examples:
pt_br: Exemplos:

source: Import Nim files in Python
pt_br: Importar arquivos Nim em Python

source: Python Syntax for Nim
pt_br: Sintaxe Python para Nim

source: Publish to PYPI
pt_br: Publicar no PYPI

source: Silent Compilation
pt_br: Compilação silenciosa

source: If you want the compilation to be completely silent (you may miss important warnings and hints), you can add to the compile command `--hints:off --verbosity:0`.
pt_br: Se você quiser que a compilação fique completamente silenciosa (você pode perder avisos e dicas importantes), você pode adicionar ao comando de compilação `—hints:off —verbosity:0`.

source: Compiler Help
pt_br: Ajuda do compilador

source: The compiler help is long. To make it more user friendly only the most frequent commands are shown with `--help`. If you want to see the full help you can use `--fullhelp`.
pt_br: A ajuda do compilador é longa. Para torná-lo mais fácil de usar, apenas os comandos mais frequentes são mostrados com `—help`. Se você quiser ver a ajuda completa, você pode usar `—fullhelp`.

source: Build Modes
pt_br: Modos de construção

source: When your code is ready for production you should use a Release build, you can add to the compile command `-d:release`.
pt_br: Quando seu código estiver pronto para produção, você deve usar uma compilação Release, você pode adicionar ao comando de compilação `-d:release`.

source: Release Build
pt_br: Versão de compilação

source: Debug Build
pt_br: Compilação de depuração

source: Speed
pt_br: Rapidez

source: Fast
pt_br: Rápido

source: Slow
pt_br: Lento

source: File Size
pt_br: Tamanho do arquivo

source: Small
pt_br: Pequeno

source: Big
pt_br: Grande

source: Optimized
pt_br: Otimizado

source: Tracebacks
pt_br: Tracebacks (Pilhas de Rastreamento)

source: Run-time checks
pt_br: Verificações em tempo de execução

source: Compile-time checks
pt_br: Verificações em tempo de compilação

source: Nim compiles to C, so it can run on Arduino and similar hardware.
pt_br: O Nim compila em C, para que possa ser executado no Arduino e em hardware similar.

source: Has several memory management strategies to fit your needs, including full manual memory management. Nim binaries are small when built for Release and it can fit the hardware tiny storage.
pt_br: Tem várias estratégias de gerenciamento de memória para atender às suas necessidades, incluindo gerenciamento manual completo da memória. Os binários Nim são pequenos quando construídos para o Release e podem caber no pequeno armazenamento do hardware.

source: SuperCollider is C++ so it can be re-utilized using Nim.
pt_br: O SuperCollider é C++, então ele pode ser reutilizado usando o Nim.

source: Theoretically, Nim SuperCollider plugins should be just as fast as C code. Nim's metaprogramming allows us to build LiveCoding friendly DSLs.
pt_br: Teoricamente, os plug-ins do Nim SuperCollider devem ser tão rápidos quanto o código C. A metaprogramação de Nim nos permite criar DSLs compatíveis com LiveCoding.

source: Some projects for Nim LiveCoding:
pt_br: Alguns projetos para o Nim LiveCoding:

source: See [this](http://rosettacode.org/wiki/Abstract_type#Nim)
pt_br: Veja [isso](http://rosettacode.org/wiki/Abstract_type#Nim)

source: Philosophy
pt_br: Filosofia

source: The key to understanding Nim is that Nim was designed to be as fast as C, but to be much safer. Many of the design decisions are based on making it harder to shoot yourself in the foot. In Python, there are no pointers (everything is treated as a reference). While Nim does give you pointers, Nim gives you other, safer tools for your everyday needs, while pointers are mostly reserved for interfacing with C and doing low-level system programming.
pt_br: A chave para entender o Nim é que o Nim foi projetado para ser tão rápido quanto C, mas para ser muito mais seguro. Muitas das decisões de design são baseadas em tornar mais difícil dar um tiro no próprio pé. Em Python, não há ponteiros (tudo é tratado como referência). Enquanto o Nim fornece dicas, o Nim oferece outras ferramentas mais seguras para suas necessidades diárias, enquanto os ponteiros são principalmente reservados para a interface com C e a programação de sistemas de baixo nível.

source: Contrarily to Python, most Nim code can be executed at compile time to perform meta-programming. You can do a lot of the DSLs possible with Python decorators/metaprogramming with Nim macros and pragmas. (And some stuff that you can't!). Of course, this requires some different patterns and more type safety.
pt_br: Ao contrário do Python, a maior parte do código Nim pode ser executada em tempo de compilação para realizar metaprogramação. Você pode fazer muitas das DSLs possíveis com decoradores/metaprogramação Python com macros e pragmas Nim. (E algumas coisas que você não pode!). Obviamente, isso requer alguns padrões diferentes e mais segurança de tipos.

source: [ :arrow_up: :arrow_up: :arrow_up: :arrow_up: ](#table-of-contents "Go to top")
pt_br: [ :arrow_up: :arrow_up: :arrow_up: :arrow_up: ](#table-of-contents "Ir para o topo")
