Repository: lskbr/nim_for_python_programmers
Catalog: locale/*/LC_MESSAGES/Nim-for-Python-Programmers.po
Languages: pt_br

source: Nim has a [wrapnils module](https://nim-lang.github.io/Nim/wrapnils.html) with a `?.` null-coalescing operator, which simplifies code by reducing the need for `if..elif...else` branches around **intermediate values that may be null**.
pt_br: Nim tem um [módulo wrapnils](https://nim-lang.github.io/Nim/wrapnils.html) com um `?. `operador de coalescência nula, que simplifica o código ao reduzir a necessidade de ramificações `if.. elif... else` em torno de **valores intermediários que podem ser nulos**.

source: Null is `None` in Python. Null is `nil` in Nim.
pt_br: Null é `None` em Python. Null é `nil` em Nim.

source: See: https://nim-lang.github.io/Nim/wrapnils.html
pt_br: Veja: https://nim-lang.github.io/Nim/wrapnils.html

source: There is no direct built-in equivalent to Python's `with` construct. In Nim there are the following options:
pt_br: Não há equivalente nativo direto à construção `with` do Python. No Nim, existem as seguintes opções:

source: [See the Templates section for examples.](#templates)
pt_br: [Consulte a seção Modelos para ver exemplos.](#templates)

source: Multi-line string
pt_br: String de várias linhas

source: Raw String
pt_br: String Raw

source: Multi-line Raw string
pt_br: String Raw de múltiplas linhas

source: Formatted Literals
pt_br: Literais formatados

source: Quote
pt_br: Quote (mascarando)

source: String Ops
pt_br: Operações de string

source: Ops
pt_br: Operações

source: Concatenation
pt_br: Concatenação

source: `"a" & "b"`
pt_br: `"a” e “b"`

source: Starts With
pt_br: Começa com

source: Ends With
pt_br: Termina com

source: Split Lines
pt_br: Dividindo por Linha

source: Slicing
pt_br: Fatiando

source: Slicing 1 char
pt_br: Cortando 1 caractere

source: Reverse Slicing
pt_br: Corte reverso

source: [`unicodedata.normalize("NFC", "Foo")`](https://docs.python.org/3/library/unicodedata.html#unicodedata.normalize "str().lower() is not the recommended way")
pt_br: [`unicodedata.normalize("NFC", "Foo")`](https://docs.python.org/3/library/unicodedata.html#unicodedata.normalize "str().lower() não é a forma recomendada")

source: Count Lines
pt_br: Contando Linhas

source: Repeat
pt_br: Repeat (repetir)

source: Indent
pt_br: Recuar (indent)

source: [`textwrap.dedent("foo")`](https://docs.python.org/3/library/textwrap.html#textwrap.dedent "textwrap.dedent() Removes ALL indentation!")
pt_br: [`textwrap.dedent(“foo”)`](https://docs.python.org/3/library/textwrap.html#textwrap.dedent “textwrap.dedent () Remove TODA a indentação!”)

source: [`bool(distutils.util.strtobool("fALse"))`](https://stackoverflow.com/q/715417 "bool('fALse') == True") :question:
pt_br: [`bool(distutils.util.strtobool (“fALse”)) `](https://stackoverflow.com/q/715417 “bool ('FalSE') == True”) :pergunta:

source: Formatted String Literals
pt_br: Literais de string formatados

source: Levenshtein distance
pt_br: Distância de Levenshtein

source: **Nim string operations require [`import std/strutils`.](https://nim-lang.org/docs/strutils.html)**
pt_br: **As operações de string Nim requerem [`import std/strutils`.](https://nim-lang.org/docs/strutils.html) **

source: A [very detailed comparison.](https://scripter.co/notes/string-functions-nim-vs-python/)
pt_br: [Uma comparação muito detalhada.](https://scripter.co/notes/string-functions-nim-vs-python/)

source: String Efficiency
pt_br: Eficiência de String

source: Single memory allocation strings can be done with `newStringOfCap(capacity = 42)`, that returns a new empty string `""` but with allocated `capacity` of `42`. If you pass beyond the `capacity` it will not crash nor buffer overflow:
pt_br: Strings podem ser alocadas em memória de uma só vez com `newStringOfCap (capacity = 42) `, que retorna uma nova string vazia `""`, mas com `capacidade` alocada de `42`. Se você ultrapassar a `capacidade`, ela não falhará nem estourará o buffer:

source: This difference may get bigger for strings inside for loops or while loops.
pt_br: Essa diferença pode ficar maior para strings dentro de laços for ou while.

source: Nim `strformat` implements formatted string literals inspired by Python f-strings. `strformat` is implemented using metaprogramming and the code expansion is done at compile-time. It also works for the JavaScript target.
pt_br: Nim `strformat` implementa literais de string formatados inspirados nas f-strings do Python. O `strformat` é implementado usando metaprogramação e a expansão do código é feita em tempo de compilação. Também funciona para o destino JavaScript.

source: Similar to Python f-strings, you can [debug the key-value inside the string using an equal sign](https://nim-lang.github.io/Nim/strformat.html#debugging-strings). `fmt"{key=}"` expands to `fmt"key={value}"`:
pt_br: Semelhante às f-strings do Python, você pode [depurar o valor da chave dentro da string usando um sinal de igual](https://nim-lang.github.io/Nim/strformat.html#debugging-strings). `fmt "{key=}" `se expande para `fmt"key= {value} "`:

source: Nim `strformat` supports backslash, while Python's f-strings do not:
pt_br: Nim `strformat` suporta barra invertida, enquanto as strings f do Python não:

source: You can choose a custom character pair to open and close the formatting inside the string by passing the `char` as argument:
pt_br: Você pode escolher um par de caracteres personalizado para abrir e fechar a formatação dentro da string passando o `char` como argumento:

source: Using characters like backtick and space `' '` works:
pt_br: Usar caracteres como apóstrofo invertido e espaço `' '`funciona:

source: [It is recommended to read the full documentation of `strformat`.](https://nim-lang.github.io/Nim/strformat.html)
pt_br: [É recomendável ler a documentação completa do `strformat`.](https://nim-lang.github.io/Nim/strformat.html)

source: Python raw string can not end in `"\"`, but Nim raw string works just fine:
pt_br: A string raw do Python não pode terminar em `"\"`, mas a string raw do Nim funciona muito bem:

source: This may be relevant when working with strings that use `"\"`, like filesystems paths `r"C:\mypath\"`, etc.
pt_br: Isso pode ser relevante ao trabalhar com cadeias de caracteres que usam `"\"`, como caminhos de sistemas de arquivos `r” C:\mypath\ "`, etc.

source: Standard Library Equivalents
pt_br: Equivalentes de biblioteca padrão

source: [Python Standard Library for Nim.](https://github.com/juancarlospaco/cpython#alternative-stdlib-for-nim-for-python-targets)
pt_br: [Biblioteca padrão Python para Nim.](https://github.com/juancarlospaco/cpython#alternative-stdlib-for-nim-for-python-targets)

source: Operating System
pt_br: Sistema operacional

source: String operations
pt_br: Operações de string

source: Date & time
pt_br: Data e hora

source: Regular expressions (Backend)
pt_br: Expressões regulares (Backend)

source: Regular expressions (Frontend)
pt_br: Expressões regulares (Frontend)

source: Logging
pt_br: Logando

source: [logging](https://nim-lang.org/docs/logging.html)
pt_br: [registro](https://nim-lang.org/docs/logging.html)

source: Run external commands
pt_br: Executando comandos externos

source: Path manipulation
pt_br: Manipulação de caminhos (path)

source: Mathematic
pt_br: Matemática

source: MIME Types
pt_br: Tipos MIME

source: mimetypes
pt_br: tipos MIME

source: Levenshtein Distance
pt_br: Distância de Levenshtein

source: Serialization
pt_br: Serialização

source: Open web browser URL
pt_br: Abre o URL do navegador da web

source: Unittests
pt_br: Testes unitários

source: Colors
pt_br: Cores

source: HTTP Server
pt_br: Servidor HTTP

source: URL & URI
pt_br: URL E URI

source: Parse command line arguments
pt_br: Parâmetros da linha de comando

source: HTTP Cookies
pt_br: Cookies HTTP

source: Statistics
pt_br: Estatísticas

source: Text wrapping
pt_br: Empacotamento de texto (Text Wrapping)

source: Windows Registry
pt_br: Registro do Windows

source: Monotonic time
pt_br: Tempo monotônico

source: Run functions at exit
pt_br: Executar funções na saída

source: Set file permissions
pt_br: Definir permissões de arquivo

source: Recursive walk of filesystem
pt_br: Percurso recursivo do sistema de arquivos

source: Templating engine
pt_br: Mecanismo de modelagem

source: B-Tree based ordered Dictionary
pt_br: Dicionário ordenado baseado na árvore B

source: Pooled Memory Allocation
pt_br: Alocação de memória agrupada

source: Parse JSON
pt_br: Analisar JSON

source: Parse INI
pt_br: Analisar INI

source: Parse XML
pt_br: Analisar XML

source: Parse HTML
pt_br: Analisar HTML

source: Parse SQL
pt_br: Analisar SQL

source: Colors on the Terminal
pt_br: Cores no terminal

source: Linux Distro Detection
pt_br: Detecção de distribuição Linux

source: HTML Generator
pt_br: Gerador de HTML

source: Arrow Functions
pt_br: Funções de seta (arrow)

source: In-Place to Work-on-Copy
pt_br: In-Place para Work-on-Copy

source: Syntax Sugar
pt_br: Sintaxe Sugar

source: JavaScript & Frontend
pt_br: JavaScript e frontend

source: This is not complete, but just a quick overview. For more information see https://nim-lang.org/docs/lib.html
pt_br: Isso não está completo, mas apenas uma visão geral rápida. Para obter mais informações, consulte https://nim-lang.org/docs/lib.html

source: Tuples
pt_br: Tuplas

source: Tuples are fixed size, start at index `0`, can contain mixed types, and can be anonymous or named. Named tuples have no extra overhead over anonymous tuples.
pt_br: As tuplas têm tamanho fixo, começam no índice `0`, podem conter tipos mistos e podem ser anônimas ou nomeadas. Tuplas nomeadas não têm nenhuma sobrecarga extra sobre tuplas anônimas.

source: Anonymous Tuple
pt_br: Tupla anônima

source: Named Tuple
pt_br: Tuple Nomeada

source: Nim allows the fields to be named, without requiring the tuple itself to be named. Python NamedTuple requires `import collections`, and we need to give it a dummy underscore name:
pt_br: O Nim permite que os campos sejam nomeados, sem exigir que a própria tupla seja nomeada. O Python NamedTuple requer `import collections`, e precisamos dar a ele um nome fictício de sublinhado:

source: We can also name both the fields and the tuple:
pt_br: Também podemos nomear os campos e a tupla:

source: `tuple[key0: string, key1: int]` is the `typedesc` for Declarations. `(key0: "foo", key1: 42)` is the Literal for Assigns.
pt_br: `tuple [key0: string, key1: int] `é o `typedesc` para Declarações. `(key0: “foo”, key1:42)` é o literal para atribuições.

source: Nim tuples are a lot like Python NamedTuple in that the tuple members have names.
pt_br: As tuplas do Nim são muito parecidas com Python NamedTuple, pois os membros da tupla têm nomes.

source: Do NOT use named tuples to "mimic" proper objects (the compiler re-uses generic instantiations for "identical" tuples).
pt_br: NÃO use tuplas nomeadas para “imitar” objetos apropriados (o compilador reutiliza instanciações genéricas para tuplas “idênticas”).

source: See [manual](http://nim-lang.org/docs/manual.html#types-tuples-and-object-types) for a more in depth look at tuples.
pt_br: Veja [manual](http://nim-lang.org/docs/manual.html#types-tuples-and-object-types) para uma análise mais aprofundada das tuplas.

source: Lists
pt_br: Listas

source: [Nim sequences](http://nim-lang.org/docs/tut1.html#advanced-types-sequences) are *not* fixed size. They can grow and shrink, start at index `0`, and must contain elements all of the same type.
pt_br: [Nim sequences](http://nim-lang.org/docs/tut1.html#advanced-types-sequences) *não* são de tamanho fixo. Eles podem crescer e encolher, começar no índice `0` e devem conter elementos do mesmo tipo.

source: [@](https://nim-lang.github.io/Nim/system.html#%40%2CopenArray%5BT%5D) is a function that converts from `array` to `seq`.
pt_br: [@](https://nim-lang.github.io/Nim/system.html#%40%2CopenArray%5BT%5D) é uma função que converte de `array` para `seq`.

source: A comprehension can be assigned to `const` too, and it will run at compile-time.
pt_br: Uma comprehension também pode ser atribuída a `const` e será executada em tempo de compilação.

source: The comprehension is implemented as a `macro` that is expanded at compile-time, you can see the expanded code using the `--expandMacro` compiler option:
pt_br: A comprehension é implementada como uma `macro` que é expandida em tempo de compilação. Você pode ver o código expandido usando a opção de compilador `—expandMacro`:

source: The comprehensions can be nested, multi-line, multi-expression, all with zero overhead:
pt_br: As comprehension podem ser aninhadas, com várias linhas e com várias expressões, tudo sem sobrecarga:

source: Single-line example:
pt_br: Exemplo de linha única:

source: Python comprehensions convert the code to a generator, but Nim comprehensions do not convert the code to an iterator:
pt_br: As comprehension de Python convertem o código em um gerador, mas as compreensões de Nim não convertem o código em um iterador:

source: Python complains:
pt_br: Python reclama:

source: Some things that in Python are syntactically disallowed inside comprehensions (like `return`) are allowed in Nim. This is because Nim comprehensions are just macros that expand to normal code.
pt_br: Algumas coisas que em Python são sintaticamente proibidas dentro de compreensões (como `return`) são permitidas no Nim. Isso ocorre porque as compreensões do Nim são apenas macros que se expandem para o código normal.

source: Whats `collect()`?.
pt_br: O que é `collect () `?.

source: Sets
pt_br: Conjuntos (sets)

source: Set
pt_br: Conjunto (set)

source: Ordered Set
pt_br: Set ordenado

source: **Python Set can be replaced with [HashSet](http://nim-lang.org/docs/sets.html).**
pt_br: **O Python set pode ser substituído por [HashSet](http://nim-lang.org/docs/sets.html) .**

source: Python sets are not like the [Nim set type](http://nim-lang.org/docs/manual.html#types-set-type). The "default" set is a [bitset](https://en.wikipedia.org/wiki/Bitset). For every possible value of the contained type, it stores 1 bit indicating whether it is present in the set. This means you should use it if the type has a finite, limited range of possible values. If all of the possible values are also known at compile-time, you can create an `Enum` for them.
pt_br: Os conjuntos Python não são como o [tipo de conjunto Nim](http://nim-lang.org/docs/manual.html#types-set-type). O conjunto “padrão” é um [bitset](https://en.wikipedia.org/wiki/Bitset). Para cada valor possível do tipo contido, ele armazena 1 bit indicando se ele está presente no conjunto. Isso significa que você deve usá-lo se o tipo tiver uma faixa finita e limitada de valores possíveis. Se todos os valores possíveis também forem conhecidos em tempo de compilação, você poderá criar um `Enum` para eles.

source: The biggest integer you can fit on a set normally is `65535` equals to `high(uint16)`.
pt_br: O maior número inteiro que você pode caber em um conjunto normalmente é `65535` igual a `high (uint16) `.

source: You can fit bigger integers using an integer Subrange, if you don't need small integers. An example really stressing set to fit `2_147_483_647` equals to `high(int32)` on a set at compile-time:
pt_br: Você pode ajustar números inteiros maiores usando um Subrange inteiro, se não precisar de números inteiros pequenos. Um exemplo realmente estressante de definir para caber `2_147_483_647` é igual a `high (int32) `em um conjunto em tempo de compilação:

source: The basic Nim set type is fast and memory-efficient, compared to the [HashSet](http://nim-lang.org/docs/sets.html) which is implemented as a dictionary. For simple flag types and small mathematical sets, use set. For larger collections, or if you are just learning, use HashSet.
pt_br: O tipo de conjunto (set) básico do Nim é rápido e economiza memória, em comparação com o [HashSet](http://nim-lang.org/docs/sets.html), que é implementado como um dicionário. Para tipos de flags simples e pequenos conjuntos matemáticos, use set. Para coleções maiores, ou se você está apenas aprendendo, use o HashSet.

source: Dictionaries
pt_br: Dicionários

source: Use [tables](http://nim-lang.org/docs/tables.html) for Python-like dicts.
pt_br: Use [tables](http://nim-lang.org/docs/tables.html) para dicionários semelhantes ao Python.

source: Dictionary
pt_br: Dicionário

source: Ordered Dictionary
pt_br: Dicionário ordenado

source: Table Constructors
pt_br: Construtores de tabela

source: Counters
pt_br: Contadores

source: **Examples:**
pt_br: **Exemplos: **

source: Tables are just syntax sugar for an array of tuples:
pt_br: As tabelas são apenas açúcar de sintaxe para uma matriz de tuplas:

source: B-Tree Tables
pt_br: Tabelas Árvores-B

source: [B-Tree based generic sorted Tables](https://nim-lang.github.io/Nim/btreetables.html) using the same API.
pt_br: [Tabelas ordenadas genéricas baseadas em Árvore-B](https://nim-lang.github.io/Nim/btreetables.html) usando a mesma API.

source: [Whats B-Tree ? (Wikipedia).](https://en.wikipedia.org/wiki/B-tree)
pt_br: [O que é B-Tree? (Wikipédia).](https://en.wikipedia.org/wiki/B-tree)

source: [Whats B-Tree ? (1 Minute Animated Video).](https://youtu.be/coRJrcIYbF4)
pt_br: [O que é B-Tree? (Vídeo animado de 1 minuto).](https://youtu.be/coRJrcIYbF4)

source: Ternary operators
pt_br: Operadores ternários

source: In Nim the "ternary operator" is simply an `if..else` inline. Unlike Python, the ordinary `if..else` is an expression, so it can be assigned to a variable. These snippets are equivalent:
pt_br: Em Nim, o “operador ternário” é simplesmente um `if.. else` em linha. Ao contrário do Python, o `if.. else` comum é uma expressão, portanto, ele pode ser atribuído a uma variável. Esses trechos são equivalentes:

source: Reading and writing files
pt_br: Lendo e escrevendo arquivos

source: **Reading files line by line**
pt_br: **Lendo arquivos linha por linha**

source: `lines()` Documentation https://nim-lang.org/docs/io.html#lines.i%2Cstring
pt_br: `lines()` Documentação https://nim-lang.org/docs/io.html#lines.i%2Cstring

source: **Reading and writing files:**
pt_br: **Lendo e gravando arquivos: **

source: **Reading files at compile-time:**
pt_br: **Lendo arquivos em tempo de compilação: **

source: Change File Permissions
pt_br: Alterar permissões de arquivo

source: These examples assume a file `"file.txt"` exists. [Both use the octal Unix file permissions.](https://en.wikipedia.org/wiki/File-system_permissions#Notation_of_traditional_Unix_permissions) [Also a lower level API is available on `os` module.](https://nim-lang.github.io/Nim/os.html#setFilePermissions%2Cstring%2Cset%5BFilePermission%5D)
pt_br: Esses exemplos assumem que existe um arquivo `” file.txt “`. [Ambos usam as permissões octais de arquivo Unix.](https://en.wikipedia.org/wiki/File-system_permissions#Notation_of_traditional_Unix_permissions) [Além disso, uma API de nível inferior está disponível no módulo `os`.](https://nim-lang.github.io/Nim/os.html#setFilePermissions%2Cstring%2Cset%5BFilePermission%5D)

source: See https://nim-lang.github.io/fusion/src/fusion/filepermissions.html
pt_br: Veja https://nim-lang.github.io/fusion/src/fusion/filepermissions.html

source: Temporarily Change Folder
pt_br: Alterar pasta temporariamente

source: These examples assume a folder `"subfolder"` exists. Python optionally has third-party dependencies which do the same thing; the examples use the standard library. Some Python third-party dependencies may convert the code inside `withDir` to a generator, forcing you to change the code (like `return` to `yield` etc), examples use standard library.
pt_br: Esses exemplos assumem que existe uma pasta `"subfolder"`. Opcionalmente, o Python tem dependências de terceiros que fazem a mesma coisa; os exemplos usam a biblioteca padrão. Algumas dependências de terceiros do Python podem converter o código dentro de `withDir` em um gerador, forçando você a alterar o código (como `return` para `yield` etc), exemplos usam biblioteca padrão.

source: See https://nim-lang.github.io/fusion/src/fusion/scripting.html
pt_br: Veja https://nim-lang.github.io/fusion/src/fusion/scripting.html

source: Map & Filter
pt_br: Map e filter

source: map and filter operations require [`import std/sequtils`.](https://nim-lang.org/docs/sequtils.html)
pt_br: operações de map e filter requerem [`import std/sequtils`.](https://nim-lang.org/docs/sequtils.html)

source: Multi-line example:
pt_br: Exemplo em várias linhas:

source: Python anonymous functions can not use `return`, but it just works in Nim:
pt_br: As funções anônimas do Python não podem usar `return`, mas podem no Nim:

source: Complains `SyntaxError: invalid syntax`.
pt_br: Reclamações `SyntaxError: sintaxe inválida`.

source: Python anonymous functions can not use `yield`, but it just works in Nim:
pt_br: As funções anônimas do Python não podem usar `yield`, mas podem no Nim:

source: [Anonymous procs in Nim](https://nim-lang.org/docs/manual.html#procedures-anonymous-procs) are basically functions without a name.
pt_br: [Processos anônimos em Nim](https://nim-lang.org/docs/manual.html#procedures-anonymous-procs) são basicamente funções sem nome.

source: Decorators
pt_br: Decoradores

source: Templates and macros can be used similarly to Python's decorators.
pt_br: Modelos e macros podem ser usados de forma semelhante aos decoradores do Python.

source: Why doesn't Nim use `@decorator` syntax?.
pt_br: Por que o Nim não usa a sintaxe `@decorator`?.

source: Nim uses `{.` and `.}` because it can have several decorators together.
pt_br: Nim usa `{.` e`.} `porque pode ter vários decoradores juntos.

source: Also in Nim one works on variables and types:
pt_br: Também no Nim, trabalha-se com variáveis e tipos:

source: Python uses multi-line strings with JSON inside, Nim uses literal JSON directly in the code.
pt_br: Python usa strings de várias linhas com JSON interno, Nim usa JSON literal diretamente no código.

source: `%*` converts everything inside the braces to JSON, JSON has a type `JsonNode`.
pt_br: `%*` converte tudo dentro dos colchetes em JSON, o JSON tem um tipo `JsonNode`.

source: `%*` can have variables and literals inside the braces.
pt_br: `%*` pode ter variáveis e literais dentro dos colchetes.

source: JSON can have Nim comments inside the braces of `%*`.
pt_br: O JSON pode ter comentários de Nim entre colchetes de `%*`.

source: If the JSON is not valid JSON, the code will not compile.
pt_br: Se o JSON não for um JSON válido, o código não será compilado.

source: `JsonNode` can be useful in Nim because is a type that can have [mixed types](https://nim-lang.github.io/Nim/manual.html#types-object-variants) and can grow/shrink.
pt_br: `JsonNode` pode ser útil no Nim porque é um tipo que pode ter [tipos mistos](https://nim-lang.github.io/Nim/manual.html#types-object-variants) e pode crescer/encolher.

source: You can read JSON at compile-time, and store it in a constant as a string.
pt_br: Você pode ler o JSON em tempo de compilação e armazená-lo em uma constante como uma string.

source: To parse JSON from a string you can use `parseJson("{}")`.
pt_br: Para analisar o JSON a partir de uma string, você pode usar `parseJSON(“{}”) `.

source: To parse JSON from a file use `parseFile("file.json")`.
pt_br: Para analisar o JSON de um arquivo, use `parseFile(“file.json”) `.

source: [JSON documentation](https://nim-lang.org/docs/json.html)
pt_br: [Documentação JSON](https://nim-lang.org/docs/json.html)

source: Self-Execution of Main Module
pt_br: Auto-execução do módulo principal

source: [Unittest documentation.](https://nim-lang.org/docs/unittest.html)
pt_br: [Documentação do Unittest.](https://nim-lang.org/docs/unittest.html)
